Vapi27/gottfa-esp32/src/arena_net.cpp
  //  POST /api/zones with the same JSON shape -> replace + persist the insert map.
  s_server.on("/api/zones", HTTP_POST,
    [](AsyncWebServerRequest* r) {
      String* body = (String*)r->_tempObject;
      // No body at all is almost never malformed JSON — it is the wrong content
      // type. ESPAsyncWebServer swallows application/x-www-form-urlencoded and
      // multipart into request params and never calls the body handler, so
      // `curl -d` silently arrives here empty while the browser's fetch (which
      // sends text/plain) works. Say which of the two failures this is.
      if (!body) {
        r->send(400, "text/plain",
                "empty body - send the JSON raw, not form-encoded "
                "(curl: --data-binary + -H 'Content-Type: application/json')");
        return;
      }
      bool ok = arenamap::fromJson(body->c_str());
      if (ok) ok = arenamap::save();
      delete body; r->_tempObject = nullptr;
      r->send(ok ? 200 : 400, "text/plain", ok ? "map saved" : "bad map json");
    },
    nullptr,
    [](AsyncWebServerRequest* r, uint8_t* data, size_t len, size_t index, size_t total) {
      if (index == 0) {
        if (r->_tempObject) delete (String*)r->_tempObject;
        String* b = new String();
        b->reserve(total + 1);
        r->_tempObject = b;
      }
      String* body = (String*)r->_tempObject;
      if (body) for (size_t i = 0; i < len; i++) body->concat((char)data[i]);
    });

  // --- Playfield geometry ---------------------------------------------------
  //  /api/pf                      the 99 inserts and where they are (fixed)
  //  /api/ledmap                  which chain index sits on which insert
  //  /api/assign?led=N&ins=M      place one pixel (ins=none to unplace it)
  //  /api/ledmap/reset            forget every placement
  s_server.on("/api/pf", HTTP_GET, [](AsyncWebServerRequest* r) {
    r->send(200, "application/json", arenapf::insertsJson());
  });

  // /api/insert?ins=N[&name=L48][&r=&g=&b=&w=][&clear=1]
  // Edit one insert: its label (the machine's own, from the manual — the shipped
  // one is a guess) and the colour of its plastic. clear=1 drops both back to
  // the shipped label and no colour.
  s_server.on("/api/insert", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (!r->hasParam("ins")) { r->send(400, "text/plain", "ins= required"); return; }
    const int ins = r->getParam("ins")->value().toInt();
    if (ins < 0 || ins >= arenapf::insertCount()) { r->send(400, "text/plain", "ins out of range"); return; }
    if (r->hasParam("clear")) {
      arenapf::setName((uint8_t)ins, "");
      arenapf::setColour((uint8_t)ins, { 0, 0, 0, 0 });
      arenapf::setHidden((uint8_t)ins, false);   // "clear" rend la pastille au plan
    } else {
      if (r->hasParam("hide"))
        arenapf::setHidden((uint8_t)ins, r->getParam("hide")->value().toInt() != 0);
      if (r->hasParam("name")) arenapf::setName((uint8_t)ins, r->getParam("name")->value().c_str());
      if (r->hasParam("r") || r->hasParam("g") || r->hasParam("b") || r->hasParam("w"))
        arenapf::setColour((uint8_t)ins, { param8(r, "r", 0), param8(r, "g", 0),
                                           param8(r, "b", 0), param8(r, "w", 0) });
    }
    arenapf::saveNames();
    arenapf::saveColours();
    arenapf::saveHidden();
    r->send(200, "application/json", arenapf::insertsJson());
  });

  s_server.on("/api/ledmap", HTTP_GET, [](AsyncWebServerRequest* r) {
    r->send(200, "application/json", arenapf::toJson());
  });

  // Saved on every click. Placing 99 inserts is a long session under a
  // playfield; losing it to a power cut at pixel 80 is not acceptable, and the
  // write is a few hundred bytes onto a partition that is otherwise idle.
  s_server.on("/api/assign", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (!r->hasParam("led")) { r->send(400, "text/plain", "led= [&ins=N|none]"); return; }
    const int led = r->getParam("led")->value().toInt();
    uint8_t ins = arenapf::UNASSIGNED;
    if (r->hasParam("ins")) {
      const String v = r->getParam("ins")->value();
      if (v != "none" && v.length()) ins = (uint8_t)v.toInt();
    }
    if (!arenapf::setLedInsert((uint16_t)led, ins)) {
      r->send(400, "text/plain", "led or ins out of range");
      return;
    }
    arenapf::save();
    r->send(200, "application/json", arenapf::toJson());
  });

  // --- Remise a zero : /api/reset?what=look|network|homes|all -----------
  // Quatre niveaux, du plus anodin au plus definitif. Ils sont separes parce
  // qu'ils ne repondent pas a la meme question : "je n'aime pas ce reglage"
  // n'appelle pas le meme geste que "je donne ce mur a quelqu'un".
  s_server.on("/api/reset", HTTP_GET, [](AsyncWebServerRequest* r) {
    const String w = r->hasParam("what") ? r->getParam("what")->value() : String("");
    if (w == "look") {
      arenaled::resetLook();
      r->send(200, "application/json", "{\"ok\":true,\"did\":\"look\"}");
      return;
    }
    if (w == "network") {
      resetNetwork();
      r->send(200, "application/json", "{\"ok\":true,\"did\":\"network\",\"reboot\":true}");
      s_rebootAt = millis() + 400;      // laisser la reponse partir
      return;
    }
    if (w == "homes") {
      r->send(200, "application/json", "{\"ok\":true,\"did\":\"homes\",\"reboot\":true}");
      forgetHomes();
      return;
    }
    if (w == "all") {
      arenaled::resetAll();
      resetNetwork();
      arenapeers::resetAll();
      r->send(200, "application/json", "{\"ok\":true,\"did\":\"all\",\"reboot\":true}");
      forgetHomes();
      s_rebootAt = millis() + 800;
      return;
    }
    if (w == "reboot") {
      r->send(200, "application/json", "{\"ok\":true,\"did\":\"reboot\"}");
      s_rebootAt = millis() + 400;
      return;
    }
    r->send(400, "application/json",
            "{\"ok\":false,\"t\":\"what= look | network | homes | all | reboot\"}");
  });

  // --- Voisinage : /api/link?v=off|mirror|relay --------------------------
  // Comment ce mur se comporte quand il en voit d'autres. La detection, elle,
  // tourne toujours : savoir qui est la ne change rien a l'affichage.
  s_server.on("/api/link", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (r->hasParam("v"))
      arenapeers::setLink(arenapeers::linkFromName(r->getParam("v")->value().c_str()));
    // Alimentation partagee : chainage USB-C. Separe du mode de liaison, parce
    // qu'on peut vouloir des murs synchronises sur des chargeurs distincts, ou
    // des murs independants sur le meme chargeur.
    if (r->hasParam("shared"))
      arenapeers::setSharedPower(r->getParam("shared")->value() != "0");
    r->send(200, "application/json",
            String("{\"link\":\"") + arenapeers::linkName(arenapeers::link()) +
            "\",\"rank\":" + String((int)arenapeers::rank()) +
            ",\"peers\":" + arenapeers::json() + "}");
  });

  // --- Nom du mur : /api/name?v=Volcano ----------------------------------
  // C'est ce qui rend quatre murs utilisables. Sans nom, un balayage du reseau
  // ne rend que des adresses IP interchangeables, et l'app Maison affiche
  // quatre accessoires au libelle identique.
  s_server.on("/api/name", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (r->hasParam("v")) {
      String v = r->getParam("v")->value();
      v.trim();
      if (v.length() > 24) v = v.substring(0, 24);
      if (v.length()) { s_name = v; s_prefs.putString("name", v); }
      else            { s_prefs.remove("name"); }   // vide = retour au nom d'usine
      arenaoled::poke();
    }
    r->send(200, "application/json",
            String("{\"name\":\"") + s_name + "\",\"mac\":\"" + s_mac +
            "\",\"note\":\"nom mDNS et point d acces au prochain demarrage\"}");
  });

  // --- WiFi provisioning: /api/wifi?ssid=...&pass=... then reboot ---------
  s_server.on("/api/wifi", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (!r->hasParam("ssid")) {
      r->send(400, "text/plain", "ssid= [&pass=]");
      return;
    }
    s_prefs.putString("ssid", r->getParam("ssid")->value());
    s_prefs.putString("pass", r->hasParam("pass") ? r->getParam("pass")->value() : String(""));
    r->send(200, "text/plain", "saved, rebooting");
    delay(200);
    ESP.restart();
  });

  // --- Game bundle upload ---------------------------------------------------
  //  POST /api/game?target=pf       multipart file -> /arena_pf.json
  //  POST /api/game?target=attract  multipart file -> /arena_attract.bin
  //
  // This is what makes the wall a product instead of a developer project: a
  // different machine is two files, uploaded from the browser — no PlatformIO,
  // no littlefs rebuild, no toolchain. The file lands in a .new temp first and
  // is VALIDATED before it replaces anything: a truncated upload or a wrong
  // file must never cost the working setup. Then a clean reboot rather than a
  // live swap — the render task reads these structures at 63 fps and a reboot
  // is 3 s of dark wall, which is cheaper than a use-after-free is expensive.
  // The pixel mapping lives in NVS and survives; a NEW table's inserts differ,
  // so stale assignments are dropped at load when they point past the table.
  s_server.on("/api/game", HTTP_POST,
    [](AsyncWebServerRequest* r) {
      const bool pf = r->hasParam("target") && r->getParam("target")->value() == "pf";
      const char* tmp = pf ? "/arena_pf.new" : "/arena_attract.new";
      const char* dst = pf ? "/arena_pf.json" : "/arena_attract.bin";
      bool ok = false;
      File f = LittleFS.open(tmp, "r");
      if (f) {
        if (pf) {
          JsonDocument doc;
          ok = !deserializeJson(doc, f) && doc["inserts"].is<JsonArray>() &&
               doc["inserts"].as<JsonArray>().size() > 0;
        } else {
          uint16_t hdr[2] = { 0, 0 };
          f.read((uint8_t*)hdr, 4);
          ok = hdr[0] > 0 && hdr[1] > 0 && hdr[1] <= ARENA_ATTRACT_MAX_FRAMES &&
               f.size() == (size_t)4 + (size_t)hdr[1] * 8;
        }
        f.close();
      }
      if (!ok) {
        LittleFS.remove(tmp);
        r->send(400, "text/plain", pf ? "not a valid pf.json (needs a non-empty inserts array)"
                                      : "not a valid attract.bin (u16 step, u16 frames <= 12288, frames x u64)");
        return;
      }
      LittleFS.remove(dst);
      LittleFS.rename(tmp, dst);
      r->send(200, "text/plain", "OK, rebooting");
      delay(200);
      ESP.restart();
    },
    [](AsyncWebServerRequest* r, String fn, size_t idx, uint8_t* data, size_t len, bool done) {
      const bool pf = r->hasParam("target") && r->getParam("target")->value() == "pf";
      const char* tmp = pf ? "/arena_pf.new" : "/arena_attract.new";
      if (!idx) { LittleFS.remove(tmp); }
      File f = LittleFS.open(tmp, idx ? "a" : "w");
      if (f) { f.write(data, len); f.close(); }
      (void)fn; (void)done;
    });

  // --- OTA: POST a firmware .bin, or the web UI with ?target=fs -------------
  //  /update             -> application partition   (firmware.bin)
  //  /update?target=fs   -> filesystem partition    (littlefs.bin)
  //
  // The second one matters more than it looks: without it the only way to change
  // the web UI is a USB cable, and this board spends its life behind a playfield.
  // The filesystem has to be unmounted before it is overwritten, so everything
  // served from LittleFS is gone until the reboot at the end — expected, not a
  // failure. Note the reply below often never reaches the client: the restart
  // beats the TCP flush, so curl reports HTTP 000 on a *successful* update.
  // Verify by uptime, not by the response (ARENA_LED.md §4 B).
  // Demande a la carte d'aller chercher elle-meme une image (voir pullOta).
  // C'est le chemin fiable sur S3 ; /update reste pour le WROOM et l'interface.
#ifdef ARENA_MATTER
  // Fait oublier toutes les maisons, le WiFi compris. La carte quitte le reseau
  // et ne revient que par un appairage Bluetooth : d'ou le mot de passe dans
  // l'URL, pour qu'un clic distrait ne mette pas le mur hors ligne.
  s_server.on("/api/matter/forget", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (!r->hasParam("confirm") || r->getParam("confirm")->value() != "oui") {
      r->send(400, "text/plain",
              "Efface les maisons Matter ET le WiFi. La carte quittera le reseau\n"
              "jusqu'a un nouvel appairage au telephone. Pour confirmer :\n"
              "  /api/matter/forget?confirm=oui\n");
      return;
    }
    r->send(200, "text/plain", "oubli en cours, la carte redemarre en appairage");
    delay(300);
    arena_matter_forget();
  });
#endif

  // --- Mise a jour par le navigateur, en morceaux ---------------------------
  // Le client telecharge le .bin depuis pinballs.store et le depose ici. C'est
  // le chemin destine au proprietaire : il ne demande aucun serveur chez lui et
  // il marche depuis un telephone.
  //
  // Pourquoi en morceaux, et pas un seul POST : un envoi d'un bloc tue le S3.
  // Mesure du 2026-08-02 - 250 ko recus sur 1,6 Mo puis chute. La cause n'est
  // pas le volume, c'est le RECOUVREMENT : esp_ota_begin() efface la partition
  // en bloquant plusieurs secondes, le navigateur continue d'emettre pendant ce
  // temps, lwIP manque de tampons et la puce tombe.
  //
  // On separe donc les phases. "begin" fait l'effacement dans SA propre requete,
  // et le navigateur attend la reponse : rien n'est en vol pendant l'effacement.
  // Ensuite chaque morceau est acquitte avant que le suivant parte, donc le
  // debit est plafonne par la carte elle-meme et ne peut plus la submerger.
  // Balayage WiFi - en LECTURE seule. Sous Matter c'est l'application Maison qui
  // fournit le reseau ; la carte ne peut pas en changer elle-meme (begin() lit
  // les identifiants puis sort avant de s'en servir). Ce que ce balayage sert
  // vraiment : savoir quelle puissance de signal le mur recoit LA OU IL EST
  // ACCROCHE, ce qu'aucun telephone tenu a la main ne dit.
  // Reveiller l'ecran a distance. Il s'eteint apres ARENA_OLED_SLEEP_MS, ce qui
  // est voulu - un menu statique se grave dans le verre d'un OLED - mais rend
  // toute verification impossible depuis l'autre bout de la maison : on flashe,
  // on va voir, il dort deja. ?s=1 le garde eveille en repoussant l'extinction
  // tant qu'on interroge.
  s_server.on("/api/oled", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (!arenaoled::found()) { r->send(404, "text/plain", "aucun panneau detecte"); return; }
    if (r->hasParam("qr")) {
      arenaoled::showQr();
      r->send(200, "text/plain", "code d'appairage affiche");
      return;
    }
    arenaoled::poke();
    r->send(200, "text/plain", "ecran reveille");
  });

