Vapi27/gottfa-esp32/src/arena_net.cpp
  s_server.on("/api/wifiscan", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (r->hasParam("results")) {
      wifi_ap_record_t apInfo = {};
      const bool apInfoOk = (esp_wifi_sta_get_ap_info(&apInfo) == ESP_OK);
      String j = "{\"age\":" + String(s_scanAt ? (millis() - s_scanAt) / 1000 : 9999) +
                 ",\"busy\":" + String(s_scanWanted ? "true" : "false") +
                 ",\"rssi\":" + String(apInfoOk ? (int)apInfo.rssi : 0) +
                 ",\"ssid\":\"" + String(apInfoOk ? (const char*)apInfo.ssid : "") + "\"" +
                 ",\"nets\":" + s_scanJson + "}";
      r->send(200, "application/json", j);
      return;
    }
    s_scanWanted = true;
    r->send(200, "text/plain", "scan lance");
  });

  s_server.on("/api/fw", HTTP_POST,
    [](AsyncWebServerRequest* r) {
      // --- begin : reserve et efface, une bonne fois ---
      if (r->hasParam("begin")) {
        const size_t sz = (size_t)r->getParam("begin")->value().toInt();
        if (sz < 65536) { r->send(400, "text/plain", "taille invalide"); return; }
        if (s_fwHandle) { esp_ota_abort(s_fwHandle); s_fwHandle = 0; }
        s_fwPart = esp_ota_get_next_update_partition(NULL);
        if (!s_fwPart) { r->send(500, "text/plain", "aucune partition OTA"); return; }
        if (sz > s_fwPart->size) { r->send(400, "text/plain", "image trop grande"); return; }
        // Taille reelle, pas OTA_SIZE_UNKNOWN : on efface ce qu'on ecrit, pas
        // les 3 Mo de la partition.
        const esp_err_t e = esp_ota_begin(s_fwPart, sz, &s_fwHandle);
        if (e != ESP_OK) {
          s_fwHandle = 0;
          r->send(500, "text/plain", String("esp_ota_begin: ") + esp_err_to_name(e));
          return;
        }
        s_fwTotal = sz; s_fwGot = 0;
        r->send(200, "text/plain", "pret");
        return;
      }
      // --- end : valide et redemarre ---
      if (r->hasParam("end")) {
        if (!s_fwHandle) { r->send(409, "text/plain", "aucun envoi en cours"); return; }
        if (s_fwGot != s_fwTotal) {
          esp_ota_abort(s_fwHandle); s_fwHandle = 0;
          r->send(400, "text/plain", "tronque " + String(s_fwGot) + "/" + String(s_fwTotal));
          return;
        }
        esp_err_t e = esp_ota_end(s_fwHandle);
        s_fwHandle = 0;
        if (e != ESP_OK) { r->send(400, "text/plain", String("image refusee: ") + esp_err_to_name(e)); return; }
        e = esp_ota_set_boot_partition(s_fwPart);
        if (e != ESP_OK) { r->send(500, "text/plain", String("set_boot: ") + esp_err_to_name(e)); return; }
        r->send(200, "text/plain", "ok, redemarrage");
        s_fwReboot = millis();          // laisse la reponse partir avant de couper
        return;
      }
      // --- abandon explicite ---
      if (r->hasParam("abort")) {
        if (s_fwHandle) { esp_ota_abort(s_fwHandle); s_fwHandle = 0; }
        s_fwGot = s_fwTotal = 0;
        r->send(200, "text/plain", "abandonne");
        return;
      }
      // --- un morceau : la reponse part ICI, apres l'ecriture ---
      if (!s_fwHandle) { r->send(409, "text/plain", "appelle ?begin= d'abord"); return; }
      r->send(200, "text/plain", String(s_fwGot));
    },
    NULL,
    // Corps brut du morceau. Ecrit au fil de l'eau : un morceau de 32 ko tient
    // dans les tampons, et l'acquittement ci-dessus ne part qu'une fois ecrit.
    [](AsyncWebServerRequest* r, uint8_t* data, size_t len, size_t index, size_t total) {
      if (!s_fwHandle || !len) return;
      if (esp_ota_write(s_fwHandle, data, len) != ESP_OK) {
        esp_ota_abort(s_fwHandle); s_fwHandle = 0;
        return;
      }
      s_fwGot += len;
    });

  s_server.on("/api/otapull", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (!r->hasParam("url")) { r->send(400, "text/plain", "url= manquant"); return; }
    if (s_pullPending) { r->send(409, "text/plain", "un telechargement est deja en cours"); return; }
    s_pullUrl     = r->getParam("url")->value();
    s_pullDone    = 0;
    s_pullTotal   = 0;
    s_pullFs      = r->hasParam("target") && r->getParam("target")->value() == "fs";
    s_pullStatus  = "demarre";
    s_pullPending = true;   // la boucle principale prend le relais
    r->send(200, "text/plain", "telechargement lance depuis " + s_pullUrl +
                               "\nsuivre otast / otadone / otatot dans /api/state");
  });

  s_server.on("/update", HTTP_POST,
    [](AsyncWebServerRequest* r) {
      bool ok = !Update.hasError();
      r->send(ok ? 200 : 500, "text/plain", ok ? "OK, rebooting" : "FAIL");
      if (ok) { delay(200); ESP.restart(); }
    },
    [](AsyncWebServerRequest* r, String fn, size_t idx, uint8_t* data, size_t len, bool done) {
      if (!idx) {
        const bool fs = r->hasParam("target") && r->getParam("target")->value() == "fs";
        Serial.printf("[ota] start %s -> %s\n", fn.c_str(), fs ? "filesystem" : "app");
        if (fs) LittleFS.end();                      // cannot be mounted while it is rewritten
        // Taille reelle plutot que UPDATE_SIZE_UNKNOWN : ce dernier efface la
        // partition entiere (3 Mo) d'un bloc et gele AsyncTCP le temps que ca
        // dure, ce qui est la cause du plantage decrit devant pullOta().
        const size_t sz = r->contentLength() ? r->contentLength() : UPDATE_SIZE_UNKNOWN;
        if (!Update.begin(sz, fs ? U_SPIFFS : U_FLASH)) Update.printError(Serial);
      }
      if (Update.write(data, len) != len) Update.printError(Serial);
      if (done) {
        if (Update.end(true)) Serial.printf("[ota] ok %u bytes\n", (unsigned)(idx + len));
        else Update.printError(Serial);
      }
    });

  s_server.serveStatic("/", LittleFS, "/");
  s_server.onNotFound([](AsyncWebServerRequest* r) { r->send(404, "text/plain", "404"); });
  s_server.begin();
}

void begin() {
  // --- WiFi: NVS credentials (set from the UI) override the compile-time ones ---
  s_prefs.begin("arenanet", false);
  {
    uint8_t m[6] = {0};
    esp_read_mac(m, ESP_MAC_WIFI_STA);
    char sfx[16]; snprintf(sfx, sizeof(sfx), "%02X%02X", m[4], m[5]);
    char mac[20]; snprintf(mac, sizeof(mac), "%02X:%02X:%02X:%02X:%02X:%02X",
                           m[0], m[1], m[2], m[3], m[4], m[5]);
    s_mac  = mac;
    s_name = s_prefs.getString("name", "");
    if (!s_name.length()) s_name = String("Playfield-") + sfx;
    Serial.printf("[net] mur '%s' (%s)\n", s_name.c_str(), s_mac.c_str());
  }
  String ssid = s_prefs.getString("ssid", ARENA_STA_SSID);
  String pass = s_prefs.getString("pass", ARENA_STA_PASS);

#ifdef ARENA_MATTER
  // Matter owns WiFi: commissioning stores the credentials and CHIP drives
  // esp_wifi. We only wait for an address. No SoftAP (an AP interface fights
  // the CHIP station state machine) and no ESPmDNS (CHIP minimal mDNS holds
  // port 5353) - reach the board by IP; proper mdns unification is P3 work.
  // No blocking wait and NO web server yet: the PASE handshake at pairing
  // time needs every byte of heap this chip has (measured: abort() on the BLE
  // connect with the server up), and a web server without an address serves
  // nobody. matterTick() below brings it up the moment WiFi is provisioned.
  Serial.println("[net] Matter owns WiFi - server deferred until an address");
  s_mode = "Matter";
  s_ip = "0.0.0.0";
  return;
#else
  WiFi.persistent(false);
  bool connected = false;
  if (ssid.length()) {
    WiFi.mode(WIFI_STA);
    WiFi.setHostname(hostify(s_name).c_str());
    WiFi.setSleep(false);            // keep the REST latency low; the wall is mains-powered
    Serial.printf("[net] STA connecting to '%s' ...\n", ssid.c_str());
    WiFi.begin(ssid.c_str(), pass.c_str());
    uint32_t t0 = millis();
    while (WiFi.status() != WL_CONNECTED && millis() - t0 < ARENA_STA_TIMEOUT_MS) {
      delay(250);
      Serial.print('.');
    }
    Serial.println();
    connected = (WiFi.status() == WL_CONNECTED);
  }
  if (connected) {
    s_mode = "STA";
    s_ip = WiFi.localIP().toString();
    Serial.printf("[net] STA OK ip=%s\n", s_ip.c_str());
  } else {
    WiFi.mode(WIFI_AP);
    WiFi.softAP(s_name.c_str(), ARENA_AP_PASS);
    s_mode = "SoftAP";
    s_ip = WiFi.softAPIP().toString();
    Serial.printf("[net] SoftAP '%s' ip=%s\n", s_name.c_str(), s_ip.c_str());
  }
  // Nom d'hote propre a la carte : sans ca, quatre murs se disputent arena.local
  // et mDNS en renomme trois en arena-2, arena-3... au petit bonheur.
  {
    String h = hostify(s_name);
    if (MDNS.begin(h.c_str())) {
      MDNS.addService("http", "tcp", 80);
      MDNS.addServiceTxt("http", "tcp", "wall", s_name.c_str());
      Serial.printf("[net] http://%s.local/\n", h.c_str());
    }
  }

#endif

  startServer();
  Serial.println("[net] http server up");
}

void loop() {
  validateImageWhenHealthy();

  // Redemarrage differe demande par /api/reset : la reponse a eu le temps de
  // partir, l'appelant sait donc que l'ordre a ete accepte.
  if (s_rebootAt && (int32_t)(millis() - s_rebootAt) >= 0) {
    Serial.println("[net] redemarrage demande");
    delay(50);
    ESP.restart();
  }

  // Le balayage tourne ICI : il bloque plusieurs secondes et n'a rien a faire
  // dans un handler HTTP.
  if (s_scanWanted) {
    s_scanWanted = false;
    // API IDF, pas l'objet Arduino WiFi : sous Matter c'est CHIP qui possede
    // esp_wifi et arenanet::begin() sort avant tout WiFi.mode(), donc le
    // wrapper Arduino n'a aucun etat - il rend 0 reseau, RSSI 0, SSID vide.
    // Meme lecon que netHasIp(), qui lit deja au niveau esp_netif.
    wifi_scan_config_t cfg = {};
    cfg.show_hidden = false;
    String j = "[";
    if (esp_wifi_scan_start(&cfg, true) == ESP_OK) {
      uint16_t n = 0;
      esp_wifi_scan_get_ap_num(&n);
      if (n > 20) n = 20;
      if (n) {
        wifi_ap_record_t* ap = (wifi_ap_record_t*)calloc(n, sizeof(wifi_ap_record_t));
        if (ap && esp_wifi_scan_get_ap_records(&n, ap) == ESP_OK) {
          for (uint16_t i = 0; i < n; i++) {
            if (i) j += ',';
            j += "{\"s\":\"" + String((const char*)ap[i].ssid) +
                 "\",\"r\":" + String((int)ap[i].rssi) +
                 ",\"c\":" + String((int)ap[i].primary) +
                 ",\"e\":" + String(ap[i].authmode == WIFI_AUTH_OPEN ? 0 : 1) + "}";
          }
        }
        free(ap);
      }
    }
    j += "]";
    s_scanJson = j;
    s_scanAt = millis();
  }

  // Redemarrage differe apres un envoi par morceaux : couper dans le handler
  // tuerait la reponse HTTP avant qu'elle parte, et le navigateur afficherait
  // un echec sur une mise a jour reussie.
  if (s_fwReboot && millis() - s_fwReboot > 600) ESP.restart();

  // Le telechargement OTA tourne ICI, dans la tache principale - surtout pas
  // dans le callback AsyncTCP, ou bloquer sur la flash fait tomber la pile WiFi.
  if (s_pullPending) {
    s_pullPending = false;
    s_pullStatus  = "en cours";
    String err;
    if (pullOta(s_pullUrl, s_pullFs, err)) {
      s_pullStatus = "ok, redemarrage";
      delay(200);
      ESP.restart();
    } else {
      s_pullStatus = "echec: " + err;
    }
  }
}

#ifdef ARENA_MATTER
// Called from loop(): once commissioning hands us a network, raise the HTTP
// server. Until then the wall renders and Matter owns the radio.
void matterTick() {
  static bool up = false;
  esp_netif_t *n = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
  esp_netif_ip_info_t info;
  if (up || !n || esp_netif_get_ip_info(n, &info) != ESP_OK || info.ip.addr == 0) return;
  up = true;
  s_ip = IPAddress(info.ip.addr).toString();
  Serial.printf("[net] ip=%s - starting the web server\n", s_ip.c_str());
  startServer();
}
#endif

}  // namespace arenanet
